#include <stdio.h>

void logic() {

	// 逻辑与运算   |
	int a = 3;
	int b = 5;
	int c = a & b;

	//	0000  0011   3
	//|	0000  0101	 5
	//  0000  0001   1
	printf("a & b=%d\n", c);

	// 逻辑或运算
	c = a | b;
	//	0000  0011   3
	//|	0000  0101	 5
	//  0000  0111	 7
	printf("a | b=%d\n", c);

	// 异或运算
	c = a ^ b;
	
	//	0000  0011   3
	//|	0000  0101	 5
	//	0000  0110   6
	printf("a ^ b=%d\n", c); //3 ^ 5 =6

	printf("--------参与异或运算实现简单的加密算法--------\n");
	printf(" 3 ^ 5=%d\n", 3 ^ 5);
	printf(" 6 ^ 3=%d\n", 6 ^ 3);
	printf(" 6 ^ 5=%d\n", 6 ^ 5);
	printf("--------参与异或运算实现简单的加密算法--------\n");

	//~取反运算
	c = ~c;
	printf("~c=%d\n", c);

	//左移运算
	c = a << 3; // a 左移3位
	//	0000  0011   3   3*2^2
	//  0001  1000   24  3*2^3  
	printf("a << 3=%d\n", c);

	//右移运算
	c = c >>2 ; //c 右移两位
	//  0001  1000   24  24 / 2^2=6
	//  0000  0110   6   
	printf("c >>2=%d\n", c);
}